{
  "_name_or_path": "bert-base-cased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PROBLEM",
    "2": "I-PROBLEM",
    "3": "E-PROBLEM",
    "4": "S-PROBLEM",
    "5": "B-TREATMENT",
    "6": "I-TREATMENT",
    "7": "E-TREATMENT",
    "8": "S-TREATMENT",
    "9": "B-TEST",
    "10": "I-TEST",
    "11": "E-TEST",
    "12": "S-TEST"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "O": 0,
    "B-PROBLEM": 1,
    "I-PROBLEM": 2,
    "E-PROBLEM": 3,
    "S-PROBLEM": 4,
    "B-TREATMENT": 5,
    "I-TREATMENT": 6,
    "E-TREATMENT": 7,
    "S-TREATMENT": 8,
    "B-TEST": 9,
    "I-TEST": 10,
    "E-TEST": 11,
    "S-TEST": 12
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.28.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
